require "to_words/version"

module ToWords

  UNDER_HUNDRED = {  "" => "", 
                     0 => "صفر", 
                     1 => "واحد",
                     2 => "اثنين",
                     3 => "ثلاثة",
                     4 => "أربعة",
                     5 => "خمسة",
                     6 => "ست",
                     7 => "سبعة",
                     8 => "ثمانية",
                     9 => "تسعة",
                     10 => "عشرة",
                     11 => "أحد عشر",
                     12 => "اثنا عشر",
                     13 => "ثلاثة عشر",
                     14 => "أربعة عشر",
                     15 => "خمسة عشر",
                     16 => "ستة عشر",
                     17 => "سبعة عشر",
                     18 => "ثمانية عشر",
                     19 => "تسعة عشر",
                     20 => "عشرين",
                     21 => "واحد وعشرين",
                     22 => "اثنين وعشرين",
                     23 => "ثلاثة وعشرين",
                     24 => "أربع وعشرين",
                     25 => "خمسة وعشرين",
                     26 => "ستة وعشرين",
                     27 => "سبعة وعشرين",
                     28 => "ثمانية وعشرين",
                     29 => "تسعة وعشرين",
                     30 => "ثلاثين",
                     31 => "واحد وثلاثون",
                     32 => "اثنين وثلاثين",
                     33 => "ثلاثة وثلاثين",
                     34 => "أربعة وثلاثين",
                     35 => "خمسة وثلاثين",
                     36 => "ستة وثلاثين",
                     37 => "سبعة وثلاثين",
                     38 => "ثمانية وثلاثين",
                     39 => "تسعة وثلاثين",
                     40 => "أربعين",
                     41 => "احد وأربعين",
                     42 => "اثنين وأربعين",
                     43 => "ثلاثة وأربعون",
                     44 => "أربعة وأربعون",
                     45 => "خمسة وأربعين",
                     46 => "ستة وأربعين",
                     47 => "سبعة وأربعون",
                     48 => "ثمان وأربعين",
                     49 => "تسعة وأربعون",
                     50 => "خمسون",
                     51 => "واحد وخمسون",
                     52 => "إثنان وخمسون",
                     53 => "ثلاثة وخمسون",
                     54 => "أربعة وخمسين",
                     55 => "خمسة وخمسون",
                     56 => "ستة وخمسين",
                     57 => "سبعة وخمسين",
                     58 => "ثمانية وخمسون",
                     59 => "تسعة وخمسون",
                     60 => "ستين",
                     61 => "واحد وستون",
                     62 => "اثنان وستون",
                     63 => "ثلاث وستون",
                     64 => "أربعة وستين",
                     65 => "خمسة وستين",
                     66 => "ستة وستين",
                     67 => "سبع وستون",
                     68 => "ثمانية وستون",
                     69 => "تسعة وستين",
                     70 => "سبعون",
                     71 => "واحد وسبعون",
                     72 => "اثنان وسبعون",
                     73 => "ثلاثة وسبعون",
                     74 => "اربعة وسبعون",
                     75 => "خمسة وسبعين",
                     76 => "ستة وسبعين",
                     77 => "سبعة وسبعون",
                     78 => "ثمانية وسبعين",
                     79 => "تسعة وسبعون",
                     80 => "ثمانين",
                     81 => "واحد وثمانين", 
                     82 => "اثنين وثمانين", 
                     83 => "ثلاثة وثمانين",
                     84 => "أربعة وثمانون",
                     85 => "خمسة وثمانين",
                     86 => "ستة وثمانون",
                     87 => "سبعة وثمانون",
                     88 => "ثمانية وثمانين",
                     89 => "تسعة وثمانون",
                     90 => "تسعين",
                     91 => "واحد وتسعون", 
                     92 => "اثنان وتسعون", 
                     93 => "ثلاثة وتسعون", 
                     94 => "أربعة وتسعون", 
                     95 => "خمسة وتسعون", 
                     96 => "ستة وتسعون",
                     97 => "سبعة وتسعين",
                     98 => "ثمانية وتسعين",
                     99 => "تسعة وتسعين", 
                     100 => "مائة"
                  }
  DIVISIONS = ["", "ألف", "مليون", "مليار", "تريليون", "كوادريليون", "كوينتيليون"]

  def to_words
    num = self.to_i
    num, sign = check_sign(num)
    return (sign + UNDER_HUNDRED[num]) if num <= 100
    counter = 0
    result = []
    while num != 0
      num, remaining = num.divmod(1000)
      temp_result = result_below_one_thousand(remaining, counter)
      result << temp_result + " " + DIVISIONS[counter] + " " if temp_result != ''
      counter += 1
    end
    return sign + result.reverse.join("و ").rstrip
  end

  def result_below_one_thousand(num, counter)
    hundred, remaining = num.divmod(100)
    return UNDER_HUNDRED[hundred] + " مائة و " + UNDER_HUNDRED[remaining]     if hundred != 0 && remaining != 0 && counter != 0
    return UNDER_HUNDRED[hundred] + " مائة و " + UNDER_HUNDRED[remaining] if hundred != 0 && remaining != 0
    return UNDER_HUNDRED[remaining]                                            if hundred == 0 && remaining != 0
    return UNDER_HUNDRED[hundred] + " مائة "                                if hundred != 0 && remaining == 0
    return ''
  end

  def check_sign(num)
    return num < 0 ? ([num.abs, 'negative ']) : ([num, ''])
  end
end

class Fixnum
  include ToWords
end

